Revit 2027 API
StairsPathType.StairsPathDirection Property
 The style of the stairs path.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public StairsPathDirection StairsPathDirection { get; }
Public ReadOnly Property StairsPathDirection As StairsPathDirection
	Get
public:
property StairsPathDirection StairsPathDirection {
	StairsPathDirection get ();
}
member StairsPathDirection : StairsPathDirection with get
Property Value
StairsPathDirection
See Also
Reference
StairsPathType Class
Autodesk.Revit.DB.Architecture Namespace